/*
需求:
鸡翁一值钱五,鸡母一值钱三,鸡雏三值钱一.百钱买百鸡,问鸡翁,鸡母,鸡雏各几何?
思路:
①第1层循环,用于表示鸡翁的范围,初始化表达式的变量定义为x=0,判断条件是x<=20
②第2层循环,用于表示鸡母的范围,初始化表达式的定义为y=0,判断条件是y<=33
③这个时候,用于表示鸡雏的变量z=100-x-y
④判断表达式z%3==0(对3取余要为0,说明要是3的倍数,因为1钱3雏鸡,所以一定是3的倍数)
和表达式5*x+3*y+z/3=100是否同时成立,如果成立,输出对应的x,y,z的值,就是对应的鸡翁,鸡母,鸡雏的值
 */

public class baiqianbaiji {
    public static void main(String[] args){
        for(int x=0;x<=20;x++){
            for(int y=0;y<=33;y++){
                int z=100-x-y;
                if(5*x+3*y+z/3==100&z%3==0){
                    System.out.println(x+","+y+","+z);

                }
            }
        }
    }
}
